x86/8259a.org
#+TITLE: 8259a 笔记


* 小记

8259a 是一个 PIC（programable interrupt controller）

用于集成多个外部中断，以可编程控制的方式，分优先级输入到 CPU INTR 中断输入中

一般由主片和从片级联而成，级联后提供 15 个中断请求。

** 中断矢量

每一个外部中断都有一个唯一的标识（整数），该标识可以通过编程设定

** 级联

将从片的 INTR 中断接入到主片的 IRQ2 端口上，以实现级联

级联物理连接与 ICW3 软件设置应保持一致

** IR,IM,IS

内部数据寄存器，需要通过 OCW 指令来操作（类似于类的成员变量，通过方法来操作）

- IR :: 锁存外部中断
- IS :: 记录正在服务的中断
- IM :: 掩码寄存器，用于屏蔽特定的中断响应

* 参考资料

** [[http://blog.csdn.net/activesys/article/details/17426609#][activesys的专栏]]

目前找到最好的介绍 8259a 的中文博客。条理清晰，而且简化了手册中复杂的 ICW 和 OCW 指令图。

没有对不重要（对理解整个流程）的 EOI 以及兼容性作过多的讨论


