x86/8259a.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-06-11 Sun 11:50 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>8259a 笔记</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Larry">
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">8259a 笔记</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org360ff69">小记</a></li>
<li><a href="#orgb5d50f1">参考资料</a></li>
</ul>
</div>
</nav>


<div id="outline-container-org360ff69" class="outline-2">
<h2 id="org360ff69">小记</h2>
<div class="outline-text-2" id="text-org360ff69">
<p>
8259a 是一个 PIC（programable interrupt controller）
</p>

<p>
用于集成多个外部中断，以可编程控制的方式，分优先级输入到 CPU INTR 中断输入中
</p>

<p>
一般由主片和从片级联而成，级联后提供 15 个中断请求。
</p>
</div>

<div id="outline-container-org5a16be6" class="outline-3">
<h3 id="org5a16be6">中断矢量</h3>
<div class="outline-text-3" id="text-org5a16be6">
<p>
每一个外部中断都有一个唯一的标识（整数），该标识可以通过编程设定
</p>
</div>
</div>

<div id="outline-container-orgd36e29a" class="outline-3">
<h3 id="orgd36e29a">级联</h3>
<div class="outline-text-3" id="text-orgd36e29a">
<p>
将从片的 INTR 中断接入到主片的 IRQ2 端口上，以实现级联
</p>

<p>
级联物理连接与 ICW3 软件设置应保持一致
</p>
</div>
</div>

<div id="outline-container-orge496565" class="outline-3">
<h3 id="orge496565">IR,IM,IS</h3>
<div class="outline-text-3" id="text-orge496565">
<p>
内部数据寄存器，需要通过 OCW 指令来操作（类似于类的成员变量，通过方法来操作）
</p>

<dl class="org-dl">
<dt>IR</dt><dd>锁存外部中断</dd>
<dt>IS</dt><dd>记录正在服务的中断</dd>
<dt>IM</dt><dd>掩码寄存器，用于屏蔽特定的中断响应</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgb5d50f1" class="outline-2">
<h2 id="orgb5d50f1">参考资料</h2>
<div class="outline-text-2" id="text-orgb5d50f1">
</div><div id="outline-container-org74e9772" class="outline-3">
<h3 id="org74e9772"><a href="http://blog.csdn.net/activesys/article/details/17426609#">activesys的专栏</a></h3>
<div class="outline-text-3" id="text-org74e9772">
<p>
目前找到最好的介绍 8259a 的中文博客。条理清晰，而且简化了手册中复杂的 ICW 和 OCW 指令图。
</p>

<p>
没有对不重要（对理解整个流程）的 EOI 以及兼容性作过多的讨论
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Larry</p>
<p class="date">Created: 2017-06-11 Sun 11:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
